In [27]:
import awswrangler as wr
import pandas as pd

In [ ]:
bucket='bucket-data'
db='database'
athenaDb = AthenaDb(bucket, db)

In [29]:
data = pd.DataFrame({ 'a': [1,2,3,4], 'b': [5,6,7,8] })
partition='b'

In [31]:
athenaDb.createTableFromData('borrar', data, partition)

In [32]:
athenaDb.readSql('select * from database.borrar')

   a  b
0  4  8
1  1  5
2  3  7
3  2  6

In [33]:
query='select * from database.borrar limit 10'
partition='b'
tableName='borrar2'
athenaDb.createTableFromQuery(tableName, query, partition)

'08f50924-5ce6-48d6-bd01-41d3c96b9374'

In [34]:
athenaDb.readSql('select * from database.borrar2')

   a  b
0  4  8
1  2  6
2  3  7
3  1  5

In [35]:
athenaDb.deleteTable('borrar2')

In [36]:
try:
    athenaDb.readSql('select * from database.borrar2')
    print("It should never be printed!")
except Exception as error:
    print(error)

SYNTAX_ERROR: line 8:3: Table awsdatacatalog.database.borrar2 does not exist. You may need to manually clean the data at location 's3://aws-athena-query-results-836263452508-us-east-1/tables/1f1278c5-fa5b-48c1-8eb4-22c954b99354' before retrying. Athena will not delete data in your account.